ESBComponents/MessageValidator/src/test/resources/Scenario3_PD_Request.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
	xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion"
	xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
	xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#">
	<S:Header>
		<To xmlns="http://www.w3.org/2005/08/addressing">https://d9yf7zn1.aegis.net:9891/CONNECTGateway/NhinService/NhinPatientDiscovery
		</To>
		<Action xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201305UV02:CrossGatewayPatientDiscovery
		</Action>
		<ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:657eef1b-4e7f-4542-b02d-0093fa535dbe
		</MessageID>
		<wsse:Security S:mustUnderstand="true">
			<wsu:Timestamp
				xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/" wsu:Id="_1">
				<wsu:Created>2012-02-06T19:14:29Z</wsu:Created>
				<wsu:Expires>2012-02-06T19:19:29Z</wsu:Expires>
			</wsu:Timestamp>
			<saml2:Assertion xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
				xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
				xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xs="http://www.w3.org/2001/XMLSchema"
				ID="638c1ba7-180c-43af-bc03-17ca00670e7e" IssueInstant="2012-02-06T19:14:29.248Z"
				Version="2.0">
				<saml2:Issuer
					Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US
				</saml2:Issuer>
				<saml2:Subject>
					<saml2:NameID
						Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">UID=Scenario 3 PDR-4.1</saml2:NameID>
					<saml2:SubjectConfirmation
						Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
						<saml2:SubjectConfirmationData>
							<ds:KeyInfo>
								<ds:KeyValue>
									<ds:RSAKeyValue>
										<ds:Modulus>0zcLhiAEnz5u0N6/3jLa3sEi32GjpwoXZJdFu0RqXE2Ta5Mi5lhDpp8jp4h5kIfvM6TW8bUlX/f5pPhUhSvFLvxXpCZLxjPq0uVGbHsdftrrpRJ06RfXFd100o0ZXWVt7AjnZtd4Qg66u86yyQUQI8yKEgepfsGkeXdcenmw4c6F9MKBVfHq75KT301K2HA9hOA9jCREeVam/mA4TjGtkm2XSskv3gjyybwH5XYjXhWgptZSushle2sINpDEdAeKUCfEfSyhTGmWdnw0cz0ophan9TsS/rkVlswBSc7Hm5fz1TkI5oeRQwafC6fTIySgiWGuWftiU8XNuHXQYU4XjQ==
										</ds:Modulus>
										<ds:Exponent>AQAB</ds:Exponent>
									</ds:RSAKeyValue>
								</ds:KeyValue>
							</ds:KeyInfo>
						</saml2:SubjectConfirmationData>
					</saml2:SubjectConfirmation>
				</saml2:Subject>
				<saml2:AuthnStatement AuthnInstant="2012-02-06T19:14:28.888Z"
					SessionIndex="123456">
					<saml2:SubjectLocality />
					<saml2:AuthnContext>
						<saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509
						</saml2:AuthnContextClassRef>
					</saml2:AuthnContext>
				</saml2:AuthnStatement>
				<saml2:AttributeStatement>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">Lab IT
							Testcase</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.0.102
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute
						Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.0.102
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:nhin:names:saml:homeCommunityId">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.0.102
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
						<saml2:AttributeValue>
							<hl7:Role xmlns:hl7="urn:hl7-org:v3"
								xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="46255001"
								codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED_CT"
								displayName="Pharmacist" xsi:type="hl7:CE" />
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
						<saml2:AttributeValue>
							<hl7:PurposeForUse xmlns:hl7="urn:hl7-org:v3"
								xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="TREATMENT"
								codeSystem="2.16.840.1.113883.3.18.7.1" codeSystemName="nhin-purpose"
								displayName="Treatment" xsi:type="hl7:CE" />
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute
						Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">RI2.102.00008^^^&amp;2.16.840.1.113883.0.102&amp;ISO
						</saml2:AttributeValue>
					</saml2:Attribute>
				</saml2:AttributeStatement>
				<saml2:AuthzDecisionStatement Decision="Permit"
					Resource="https://d9yf7zn1.aegis.net:9891/CONNECTGateway/NhinService/NhinPatientDiscovery">
					<saml2:Action Namespace="urn:oasis:names:tc:SAML:1.0:action:rwedc">Execute</saml2:Action>
					<saml2:Evidence>
						<saml2:Assertion ID="349f5162-7005-4c90-818d-2b4fc10490f1"
							IssueInstant="2012-02-06T19:14:28.888Z" Version="2.0">
							<saml2:Issuer
								Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US
							</saml2:Issuer>
							<saml2:Conditions NotBefore="2012-02-06T19:14:28.888Z"
								NotOnOrAfter="2012-02-06T19:14:28.888Z" />
							<saml2:AttributeStatement>
								<saml2:Attribute Name="AccessConsentPolicy"
									NameFormat="http://www.hhs.gov/healthit/nhin" />
								<saml2:Attribute Name="InstanceAccessConsentPolicy"
									NameFormat="http://www.hhs.gov/healthit/nhin" />
							</saml2:AttributeStatement>
						</saml2:Assertion>
					</saml2:Evidence>
				</saml2:AuthzDecisionStatement>
				<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<ds:SignedInfo>
						<ds:CanonicalizationMethod
							Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
						<ds:Reference URI="#638c1ba7-180c-43af-bc03-17ca00670e7e">
							<ds:Transforms>
								<ds:Transform
									Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
							<ds:DigestValue>H3WymHPOLbPW6hi/rDeWqS2/MFc=</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>cLnRFv/HHu7shXj+mR58pvdK5qKftpfZLqjWZjcYIxvW6A59w1xKWP9XbhsYEE2cgIXD+ykhTOdo
						ylvuXmabsrV1S4bF/9AFvDgohVgjRN64o27nxzj7LSveDb5VXRssI/z4KHyi0diM6LOFnghIvPaX
						IQwV2En71zjpeQIe+ZT7jhzUax1pxYxJ9gUYOJ4sLWyoN8fXDjf5fR2+ntbfzZN/wYTDO2x/55RB
						S62fA7UFGFtqlAP57hU1IcZ+uLVEZhJGe4thA0CMLJFkYH4Y7GGncvsTMOl7pz1x1dgEqkcxOMNQ
						5BPXDmysNX9yHtttwwq9trMaBYa/X4h4sKJH8g==</ds:SignatureValue>
					<ds:KeyInfo>
						<ds:KeyValue>
							<ds:RSAKeyValue>
								<ds:Modulus>0zcLhiAEnz5u0N6/3jLa3sEi32GjpwoXZJdFu0RqXE2Ta5Mi5lhDpp8jp4h5kIfvM6TW8bUlX/f5
									pPhUhSvFLvxXpCZLxjPq0uVGbHsdftrrpRJ06RfXFd100o0ZXWVt7AjnZtd4Qg66u86yyQUQI8yK
									EgepfsGkeXdcenmw4c6F9MKBVfHq75KT301K2HA9hOA9jCREeVam/mA4TjGtkm2XSskv3gjyybwH
									5XYjXhWgptZSushle2sINpDEdAeKUCfEfSyhTGmWdnw0cz0ophan9TsS/rkVlswBSc7Hm5fz1TkI
									5oeRQwafC6fTIySgiWGuWftiU8XNuHXQYU4XjQ==</ds:Modulus>
								<ds:Exponent>AQAB</ds:Exponent>
							</ds:RSAKeyValue>
						</ds:KeyValue>
					</ds:KeyInfo>
				</ds:Signature>
			</saml2:Assertion>
			<ds:Signature
				xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/" Id="_2">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod
						Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<exc14n:InclusiveNamespaces PrefixList="wsse S" />
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
					<ds:Reference URI="#_1">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<exc14n:InclusiveNamespaces
									PrefixList="wsu wsse S" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>+8BSfEyNotrBYUSYtqTU/vTQCSk=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>EwSTI0nH7aC987G01YpHlLPInrOlJ9IR/bkzsObuNpYG0MNo/VlHDGqA2olF0wypBROrv0zihcnP7pdX3865cYCo1Rj/0LWICuIcFqlOofWgtNaEhtG/Mg86gm9Aj5F5wEeaSm5VDvxZaYPBInO7sT7gciQ0GQcqYj3stOioY6l51pG9SBA0lxxEZ/oXweER7P06rt6xaUVjTIfnGo11+mql5HnIVEKw/NDZk59A4A5hFCS0NmA9rrMDe6Hb1bQQR1nnd9yrJA5vJPibianR8lUfUib2hIWM2T4UnL/dPSjKdxO2/1labI905MGtPhmpPHIc0gwMs0JUiSHIGniXjQ==
				</ds:SignatureValue>
				<ds:KeyInfo>
					<wsse:SecurityTokenReference
						wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
						<wsse:KeyIdentifier
							ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">638c1ba7-180c-43af-bc03-17ca00670e7e
						</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
	</S:Header>
	<S:Body>
		<PRPA_IN201305UV02 xmlns="urn:hl7-org:v3"
			xmlns:ns2="urn:gov:hhs:fha:nhinc:common:nhinccommon" xmlns:ns3="http://schemas.xmlsoap.org/ws/2004/08/addressing"
			xmlns:ns4="urn:gov:hhs:fha:nhinc:common:patientcorrelationfacade"
			ITSVersion="XML_1.0">
			<id extension="-5a3e95b1:11d1fa33d45:-7f9b" root="2.16.840.1.113883.0.102" />
			<creationTime value="20120206141428" />
			<interactionId extension="PRPA_IN201305UV02" root="2.16.840.1.113883.1.6" />
			<processingCode code="T" />
			<processingModeCode code="T" />
			<acceptAckCode code="AL" />
			<receiver typeCode="RCV">
				<device determinerCode="INSTANCE" classCode="">
					<id root="1.2.345.678.999" />
					<asAgent classCode="AGNT">
						<representedOrganization determinerCode="INSTANCE"
							classCode="ORG">
							<id root="2.16.840.1.113883.0.210" />
						</representedOrganization>
					</asAgent>
				</device>
			</receiver>
			<sender typeCode="SND">
				<device determinerCode="INSTANCE" classCode="DEV">
					<id root="2.16.840.1.113883.0.102" />
					<asAgent classCode="AGENT">
						<representedOrganization determinerCode="INSTANCE"
							classCode="ORG">
							<id root="2.16.840.1.113883.0.102" />
						</representedOrganization>
					</asAgent>
				</device>
			</sender>
			<controlActProcess moodCode="EVN" classCode="CACT">
				<code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201305UV02" />
				<authorOrPerformer typeCode="AUT">
					<assignedDevice classCode="">
						<id root="2.16.840.1.113883.0.102" />
					</assignedDevice>
				</authorOrPerformer>
				<queryByParameter>
					<queryId extension="-abd3453dcd24wkkks545" root="2.16.840.1.113883.0.102" />
					<statusCode code="new" />
					<responseModalityCode code="R" />
					<responsePriorityCode code="I" />
					<parameterList>
						<livingSubjectAdministrativeGender>
							<value code="F" />
							<semanticsText representation="TXT" />
						</livingSubjectAdministrativeGender>
						<livingSubjectBirthTime>
							<value value="19400807" />
							<semanticsText representation="TXT" />
						</livingSubjectBirthTime>
						<livingSubjectId>
							<value extension="RI2.102.00008" root="2.16.840.1.113883.0.102" />
							<semanticsText representation="TXT" />
						</livingSubjectId>
						<livingSubjectId>
							<value extension="666660008" root="2.16.840.1.113883.4.1" />
							<semanticsText representation="TXT" />
						</livingSubjectId>
						<livingSubjectName>
							<value>
								<family partType="FAM">Fleming</family>
								<given partType="GIV">Jennifer</given>
							</value>
							<semanticsText representation="TXT" />
						</livingSubjectName>
						<patientAddress>
							<value>
								<streetAddressLine>4000 Minor St</streetAddressLine>
								<city>Phoenix</city>
								<state>AZ</state>
								<postalCode>85001</postalCode>
							</value>
						</patientAddress>
						<patientTelecom>
							<value value="tel:+1-408-454-9800" />
							<semanticsText representation="TXT" />
						</patientTelecom>
					</parameterList>
				</queryByParameter>
			</controlActProcess>
		</PRPA_IN201305UV02>
	</S:Body>
</S:Envelope>