templates/xcpd_found.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <PRPA_IN201306UV02 xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
      <id root="{{ .ResponseID }}"/>
      <creationTime value="{{ .Timestamp }}"/>
      <interactionId root="2.16.840.1.113883.1.6" extension="PRPA_IN201306UV02"/>
      <processingCode code="P"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <acknowledgement>
        <typeCode code="AA"/>
      </acknowledgement>
      <controlActProcess classCode="CACT" moodCode="EVN">
{{- range .Locations }}
        <subject typeCode="SUBJ">
          <registrationEvent classCode="REG" moodCode="EVN">
            <subject1 typeCode="SBJ">
              <patient classCode="PAT">
                <id root="2.16.840.1.113883.2.4.6.3" extension="{{ .PatientID }}"/>
{{- if .SourceID }}
                <id root="{{ .SourceID }}"/>
{{- end }}
              </patient>
            </subject1>
            <custodian typeCode="CST">
              <assignedEntity classCode="ASSIGNED">
                <id root="{{ .CustodianOID }}"/>
              </assignedEntity>
            </custodian>
          </registrationEvent>
{{- range .EventCodes }}
          <queryMatchObservation>
            <value code="{{ . }}"/>
          </queryMatchObservation>
{{- end }}
          <queryByParameter>
            <livingSubjectId>
              <value root="2.16.840.1.113883.2.4.6.3" extension="{{ $.RequestedBSN }}"/>
            </livingSubjectId>
          </queryByParameter>
        </subject>
{{- end }}
      </controlActProcess>
    </PRPA_IN201306UV02>
  </soap:Body>
</soap:Envelope>
